In [12]:
"""1) Write a Python program which accepts a list named : randomList = ['a', 0, 2]. Use exception handling using try-catch which
gives the output as:
Output:
1) If the List element is a alphabet or string, the output will be
The entry is a
Oops! <class
'ValueError'>occured. Next entry.
2) If the List element is “0”,the output will be
The entry is 0
Oops! <class '
ZeroDivisionError’>occured. Next entry.
3) If the List element is and integer except 0,then output will be
The entry is 2
The reciprocal of 2 is 0.5 // reciprocal of an integer"""

lst=[]
val = input("Enter the list: ")
lst=val.split(',')
for l in lst:
    try:
        divval=1/int(l)
    except ValueError as v:
        print("The entry is {}".format(l))
        print("Oops! <class'ValueError'>occured. Next entry.")
    except ZeroDivisionError as Z:
        print("The entry is 0")
        print("Oops! <class'ZeroDivisionError'>occured. Next entry.")
    else:
        print("Entry is {}".format(l))
        print("Reciprocal of {} is {}".format(l,divval))

Enter the list: a,0,2
The entry is a
Oops! <class'ValueError'>occured. Next entry.
The entry is 0
Oops! <class'ZeroDivisionError'>occured. Next entry.
Entry is 2
Reciprocal of 2 is 0.5

In [16]:
"""Write a Python program to give exception “Array Out of Bound” if the user wants to access the elements beyond the list
size (use try and except)"""

l=input("Enter List: ").split(',')
maxval=len(l)
try:
    val=l[maxval]
except Exception as e:
    print(e)

Enter List: a,b,c,d
list index out of range

In [47]:
"""3) Write a python module script that contains fib2() method to calculate the Fibonacci series till 1000 and save it as fibo.py.
Note : The module created as fibo.py has to be placed in lib folder:
"""
from fibo import *

print("Fibonacci series - {}".format(fib2(6)))

Fibonacci series - 8

In [52]:
"""4) Write a python module script that contains ispalindrome() method to calculate the input string as palindrome string or
not and save it as palindrome.py."""


"""
def ifpalindrome(val):
    if val == val[::-1]:
        return "val is palindrome"
    else:
        return "val is not palindrome"

"""
from palindrome import ifpalindrome

instr=input("Enter the string: ")
print(ifpalindrome(instr))

Enter the string: nitin
val is palindrome

In [14]:
"""5) Write a program in Python with one class called Cipher. Within the constructor of this class, ask user for a string 
and store it. Use a static variable, key to store a randomly generated integer between 1 and 50 inclusive. 
Implement two methods,
encrypt and decrypt within this class. Encrypt generates and prints a cipher text using the user-entered string 
and the key and
ecrypt generates decrypted string from ciphertext. The cipher only encrypts alpha and numeric (A-Z, a-z, 0-9). All Symbols,
such as - , ; %, remain unencrypted. The cipher text can have special characters. 
Use generator expression to filter out alpha
and numeric characters of the input string and to generate cipher text. Create an instance of this class,
encrypt and decrypt
back the user entered string.

"""

from Crypto.Cipher import AES
from cryptography.fernet import Fernet
import random

class Cipher:

        
    def __init__(self,txt):
        self.txt=str.encode(txt) 
        self.Passkey=Fernet.generate_key()
        cipher_suite = Fernet(self.Passkey)
        self.encoded_text = cipher_suite.encrypt(self.txt)
        self.decoded_text = cipher_suite.decrypt(self.encoded_text)
        
        
        
    def encrypt(self):    
        print ("Encrypted Text is {}".format(self.encoded_text))
        return "Encrypted Text is {}".format(self.encoded_text)
    
    def decrypt(self):               
        return "Decrypted Text is {}".format(self.decoded_text)
    



cip=Cipher(input("Enter string to encrypt: "))
cip.encrypt()
cip.decrypt()

Enter string to encrypt: Hi AcadGild!
Encrypted Text is b'gAAAAABc1mOxg_oEK-OhfQKyloVPu0ETHtJCjFeXuAo4Kgns75Ylvjj4nO_DWY3sWiSTNNoZntsLTv2w2yXd6oHjeg1ZssJXMA=='

"Decrypted Text is b'Hi AcadGild!'"

In [5]:
"""6) Get Data from the following link:
http://files.grouplens.org/datasets/movielens/ml-20m.zip
We will be using the following files for this exercise:

ratings.csv : userId,movieId,rating, timestamp
tags.csv : userId,movieId, tag, timestamp
movies.csv : movieId, title, genres

1) Read the dataset using pandas."""

import pandas as pd
import numpy as np

moviesdf=pd.read_csv(r'C:\Users\Shruthi\Desktop\PythonDataScience\Assignment- 10-May\ml-20m\movies.csv')
tagsdf=pd.read_csv(r'C:\Users\Shruthi\Desktop\PythonDataScience\Assignment- 10-May\ml-20m\tags.csv')

In [8]:
ratingsdf=pd.read_csv(r'C:\Users\Shruthi\Desktop\PythonDataScience\Assignment- 10-May\ml-20m\ratings.csv')
ratingsdf.shape

(20000263, 4)

In [9]:
tagsdf.shape

(465564, 4)

In [10]:
moviesdf.shape

(27278, 3)

In [13]:
"2) Extract the first row from tags and print its type."
tagsdf.head(1).dtypes

userId        int64
movieId       int64
tag          object
timestamp     int64
dtype: object

In [18]:
"3) Extract row 0, 11, 2000 from tags DataFrame."

tagsdf.iloc[[0,11,2000]]

      userId  movieId                tag   timestamp
0         18     4141        Mark Waters  1240597180
11        65     1783      noir thriller  1368149983
2000     910    68554  conspiracy theory  1368043943

In [20]:
"5) Calculate descriptive statistics for the 'ratings' column of the ratings DataFrame. Verify using describe()."

ratingsdf.describe()

             userId       movieId        rating     timestamp
count  2.000026e+07  2.000026e+07  2.000026e+07  2.000026e+07
mean   6.904587e+04  9.041567e+03  3.525529e+00  1.100918e+09
std    4.003863e+04  1.978948e+04  1.051989e+00  1.621694e+08
min    1.000000e+00  1.000000e+00  5.000000e-01  7.896520e+08
25%    3.439500e+04  9.020000e+02  3.000000e+00  9.667977e+08
50%    6.914100e+04  2.167000e+03  3.500000e+00  1.103556e+09
75%    1.036370e+05  4.770000e+03  4.000000e+00  1.225642e+09
max    1.384930e+05  1.312620e+05  5.000000e+00  1.427784e+09

In [21]:
ratingsdf['rating'].min()

0.5

In [22]:
ratingsdf['rating'].max()

5.0

In [23]:
ratingsdf['rating'].count()

20000263

In [24]:
ratingsdf['rating'].mean()

3.5255285642993797

In [25]:
ratingsdf['rating'].var()

1.1066806862788214

In [26]:
ratingsdf['rating'].std()

1.051988919275684

In [28]:
ratingsdf['rating'].cumsum().head()

0     3.5
1     7.0
2    10.5
3    14.0
4    17.5
Name: rating, dtype: float64

In [30]:
"6) Filter out ratings with rating > 5"

ratingsdf[ratingsdf['rating'] > 5].count()

userId       0
movieId      0
rating       0
timestamp    0
dtype: int64

In [41]:
"7) Find how many null values, missing values are present. Deal with them. Print out how many rows have been modified."


ratingsdf.isnull().sum()

userId       0
movieId      0
rating       0
timestamp    0
dtype: int64

In [42]:
moviesdf.isnull().sum()

movieId    0
title      0
genres     0
dtype: int64

In [43]:
tagsdf.isnull().sum()

userId        0
movieId       0
tag          16
timestamp     0
dtype: int64

In [45]:
tagsdf[tagsdf['tag'].isnull() == True]

        userId  movieId  tag   timestamp
373276  116460      123  NaN  1199450867
373277  116460      346  NaN  1199451946
373281  116460     1184  NaN  1199452261
373288  116460     1785  NaN  1199452006
373289  116460     2194  NaN  1199450677
373291  116460     2691  NaN  1199451002
373299  116460     4103  NaN  1199451920
373301  116460     4473  NaN  1199451040
373303  116460     4616  NaN  1199452441
373319  116460     7624  NaN  1199452266
373325  116460     8898  NaN  1199450757
373332  116460    32460  NaN  1199450901
373334  116460    33826  NaN  1199450703
373339  116460    36537  NaN  1199450736
373340  116460    55805  NaN  1199450941
454615  133634    33826  NaN  1221450908

In [47]:
tagsdf[tagsdf['tag'].isnull() == True].fillna(value='Missing')

        userId  movieId      tag   timestamp
373276  116460      123  Missing  1199450867
373277  116460      346  Missing  1199451946
373281  116460     1184  Missing  1199452261
373288  116460     1785  Missing  1199452006
373289  116460     2194  Missing  1199450677
373291  116460     2691  Missing  1199451002
373299  116460     4103  Missing  1199451920
373301  116460     4473  Missing  1199451040
373303  116460     4616  Missing  1199452441
373319  116460     7624  Missing  1199452266
373325  116460     8898  Missing  1199450757
373332  116460    32460  Missing  1199450901
373334  116460    33826  Missing  1199450703
373339  116460    36537  Missing  1199450736
373340  116460    55805  Missing  1199450941
454615  133634    33826  Missing  1221450908

In [50]:
"8) Filter out movies from the movies DataFrame that are of type 'Animation'."

moviesdf[moviesdf['genres'] == 'Animation'].count()

movieId    83
title      83
genres     83
dtype: int64

In [59]:
moviesdf[moviesdf['genres'].str.contains('Animation')].count()

movieId    1027
title      1027
genres     1027
dtype: int64

In [61]:
"9) Find the average rating of movies."

ratingsdf['rating'].mean()

3.5255285642993797

In [62]:
"10) Perform an inner join of movies and tags based on movieId."

moviesdf.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [63]:
tagsdf.head()

   userId  movieId            tag   timestamp
0      18     4141    Mark Waters  1240597180
1      65      208      dark hero  1368150078
2      65      353      dark hero  1368150079
3      65      521  noir thriller  1368149983
4      65      592      dark hero  1368150078

In [66]:
"10) Perform an inner join of movies and tags based on movieId."

pd.merge(tagsdf,moviesdf,how='inner',on=['movieId']).head(10)

,userId,movieId,tag,timestamp,title,genres
0,18,4141,Mark Waters,1240597180,Head Over Heels (2001),Comedy|Romance
1,66193,4141,naive,1294446130,Head Over Heels (2001),Comedy|Romance
2,70201,4141,Mark Waters,1308333224,Head Over Heels (2001),Comedy|Romance
3,89274,4141,Freddie Prinze Jr.,1375164095,Head Over Heels (2001),Comedy|Romance
4,65,208,dark hero,1368150078,Waterworld (1995),Action|Adventure|Sci-Fi
5,619,208,Kevin Costner,1187162734,Waterworld (1995),Action|Adventure|Sci-Fi
6,2062,208,adventure,1286238272,Waterworld (1995),Action|Adventure|Sci-Fi
7,2062,208,dystopia,1286238251,Waterworld (1995),Action|Adventure|Sci-Fi
8,2062,208,dystopic future,1286238259,Waterworld (1995),Action|Adventure|Sci-Fi
9,2062,208,post-apocalyptic,1286238224,Waterworld (1995),Action|Adventure|Sci-Fi

In [105]:
"11) Print out the 5 movies that belong to the Comedy genre and have rating greater than 4."

movies_ratingsdf=pd.merge(moviesdf,ratingsdf,how='inner',on=['movieId'])
movies_ratingsdf[(movies_ratingsdf['genres'].str.contains('Comedy') == True) & (movies_ratingsdf['rating'] > 4)]['title'].unique()

array(['Toy Story (1995)', 'Grumpier Old Men (1995)',
       'Waiting to Exhale (1995)', ...,
       'George Carlin: Life Is Worth Losing (2005)',
       'Love and Pigeons (1985)', 'But Forever in My Mind (1999)'],
      dtype=object)

In [77]:
"12) Split 'genres' into multiple columns."

moviesdf['genres'].str.split('|',expand = True).head()

,0,1,2,3,4,5,6,7,8,9
0,Adventure,Animation,Children,Comedy,Fantasy,None,None,None,None,None
1,Adventure,Children,Fantasy,None,None,None,None,None,None,None
2,Comedy,Romance,None,None,None,None,None,None,None,None
3,Comedy,Drama,Romance,None,None,None,None,None,None,None
4,Comedy,None,None,None,None,None,None,None,None,None

In [97]:
"13) Extract year from title e.g. (1995)."
import datetime
	
pd.to_datetime(tagsdf['timestamp'], unit='s').dt.year.head()

0    2009
1    2013
2    2013
3    2013
4    2013
Name: timestamp, dtype: int64

In [111]:
"15) Sort the tags DataFrame based on timestamp."
tagsdf['DateTime'] = pd.to_datetime(tagsdf['timestamp'], unit='s')
tagsdf.sort_values(['DateTime'],ascending = False).head()

        userId  movieId            tag   timestamp            DateTime
339178  102853   115149  russian mafia  1427771352 2015-03-31 03:09:12
158780   46072     6058    premonition  1427760764 2015-03-31 00:12:44
158763   46072     3409    premonition  1427760726 2015-03-31 00:12:06
288375   87797      215         Vienna  1427755801 2015-03-30 22:50:01
290535   88044   106782      profanity  1427754096 2015-03-30 22:21:36

In [112]:
tagsdf.sort_values(['timestamp'],ascending = False).head()

        userId  movieId            tag   timestamp            DateTime
339178  102853   115149  russian mafia  1427771352 2015-03-31 03:09:12
158780   46072     6058    premonition  1427760764 2015-03-31 00:12:44
158763   46072     3409    premonition  1427760726 2015-03-31 00:12:06
288375   87797      215         Vienna  1427755801 2015-03-30 22:50:01
290535   88044   106782      profanity  1427754096 2015-03-30 22:21:36

In [114]:
"14) Select rows based on timestamps later than 2015-02-01."

tagsdf[tagsdf['DateTime'] > '2015-02-01'].head()

     userId  movieId      tag   timestamp            DateTime
301     318      260    1970s  1424472169 2015-02-20 22:42:49
302     318      260  fantasy  1424472169 2015-02-20 22:42:49
303     318      260   sci-fi  1424472169 2015-02-20 22:42:49
304     318   115149   Action  1424534310 2015-02-21 15:58:30
305     318   115149  Revenge  1424534283 2015-02-21 15:58:03